#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/CrutoiAlexandru/aws-server/runs/run-NSFfkQTof7EqRy1P

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
aws_iam_role.mgmnt-role: Refreshing state... [id=mgmnt-role]
aws_security_group.jenkins-server-sg: Refreshing state... [id=sg-0dfa93de1e75441d7]
aws_budgets_budget.basic-budget: Refreshing state... [id=919293050237:basic-monthly-budget]
aws_security_group.base-sg: Refreshing state... [id=sg-086984e59decb62f0]
aws_security_group.aws-mgmnt-sg: Refreshing state... [id=sg-0db082e1ce2b0d5dc]
aws_db_instance.build_number: Refreshing state... [id=terraform-20230426155325786100000001]
aws_instance.jenkins-server: Refreshing state... [id=i-098003856f3a1898a]
aws_iam_role_policy_attachment.mgmnt-instance-connect-policy-attachment: Refreshing state... [id=mgmnt-role-20230420133313656500000001]
aws_iam_instance_profile.mgmnt-profile: Refreshing state... [id=mgmnt-profile]
aws_iam_role_policy_attachment.mgmnt-ec2-policy-attachment: Refreshing state... [id=mgmnt-role-20230420133313687400000002]
aws_instance.cicd-ubuntu: Refreshing state... [id=i-07c390fe531e3955d]
aws_instance.qa-ubuntu: Refreshing state... [id=i-0f33921a35f2bed7f]
aws_instance.web-server-ubuntu: Refreshing state... [id=i-04fc3fbccb836b4ff]
aws_instance.server-mgmnt: Refreshing state... [id=i-02b9daaca305a1fdd]
aws_instance.qa-ubuntu: Drift detected (update)
aws_instance.server-mgmnt: Drift detected (update)
aws_instance.jenkins-server: Drift detected (update)
aws_instance.cicd-ubuntu: Drift detected (update)
aws_instance.web-server-ubuntu: Drift detected (update)
aws_db_instance.build_number: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.build_number must be replaced
-/+ resource "aws_db_instance" "build_number" {
      ~ address                               = "terraform-20230426155325786100000001.cvwl46yfg2dv.eu-central-1.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:eu-central-1:919293050237:db:terraform-20230426155325786100000001" -> (known after apply)
      ~ availability_zone                     = "eu-central-1b" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_window                         = "00:28-00:58" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-2019" -> (known after apply)
      + character_set_name                    = (known after apply)
      - customer_owned_ip_enabled             = false -> null
      ~ db_subnet_group_name                  = "default" -> (known after apply)
      - deletion_protection                   = false -> null
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "terraform-20230426155325786100000001.cvwl46yfg2dv.eu-central-1.rds.amazonaws.com:3306" -> (known after apply)
      ~ engine_version_actual                 = "5.7.41" -> (known after apply)
      ~ hosted_zone_id                        = "Z1RLNUO7B9Q6NB" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "terraform-20230426155325786100000001" -> (known after apply)
      ~ identifier                            = "terraform-20230426155325786100000001" -> "build-number" # forces replacement
      ~ identifier_prefix                     = "terraform-" -> (known after apply)
      ~ instance_class                        = "db.t2.micro" -> "db.t3.micro"
      ~ iops                                  = 0 -> (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      ~ license_model                         = "general-public-license" -> (known after apply)
      ~ maintenance_window                    = "wed:23:37-thu:00:07" -> (known after apply)
      - max_allocated_storage                 = 0 -> null
      + monitoring_role_arn                   = (known after apply)
      ~ multi_az                              = false -> (known after apply)
      ~ name                                  = "build_number" -> (known after apply)
      + nchar_character_set_name              = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ option_group_name                     = "default:mysql-5-7" -> (known after apply)
      ~ parameter_group_name                  = "default.mysql5.7" -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 3306 -> (known after apply)
      ~ publicly_accessible                   = false -> true
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-2YKCKWHTWF33I67HKEBLN6BMDY" -> (known after apply)
      - security_group_names                  = [] -> null
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "available" -> (known after apply)
      - storage_encrypted                     = false -> null
      ~ storage_throughput                    = 0 -> (known after apply)
      ~ storage_type                          = "gp2" -> (known after apply)
      - tags                                  = {} -> null
      ~ tags_all                              = {} -> (known after apply)
      + timezone                              = (known after apply)
      ~ vpc_security_group_ids                = [
          - "sg-038813a0f1bdcf127",
        ] -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # aws_instance.cicd-ubuntu must be replaced
-/+ resource "aws_instance" "cicd-ubuntu" {
      ~ arn                                  = "arn:aws:ec2:eu-central-1:919293050237:instance/i-07c390fe531e3955d" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "eu-central-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-07c390fe531e3955d" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-05f648ac8576e1a0c" -> (known after apply)
      ~ private_dns                          = "ip-172-31-40-186.eu-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.40.186" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "base-sg20230420110227302900000001",
        ] -> (known after apply)
      ~ subnet_id                            = "subnet-045be084c9881ad9b" -> (known after apply)
        tags                                 = {
            "Name" = "cicd-ubuntu"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0499c18af1057f4f5" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.jenkins-server must be replaced
-/+ resource "aws_instance" "jenkins-server" {
      ~ arn                                  = "arn:aws:ec2:eu-central-1:919293050237:instance/i-098003856f3a1898a" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "eu-central-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-098003856f3a1898a" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0556341f36ce17b2a" -> (known after apply)
      ~ private_dns                          = "ip-172-31-41-137.eu-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.41.137" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "jenkins-server-sg20230418104025825600000001",
        ] -> (known after apply)
      ~ subnet_id                            = "subnet-045be084c9881ad9b" -> (known after apply)
        tags                                 = {
            "Name" = "jenkins-server"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0112296ee859f2179" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.qa-ubuntu must be replaced
-/+ resource "aws_instance" "qa-ubuntu" {
      ~ arn                                  = "arn:aws:ec2:eu-central-1:919293050237:instance/i-0f33921a35f2bed7f" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "eu-central-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-0f33921a35f2bed7f" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0cc73c8bdc6999a33" -> (known after apply)
      ~ private_dns                          = "ip-172-31-35-40.eu-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.35.40" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "base-sg20230420110227302900000001",
        ] -> (known after apply)
      ~ subnet_id                            = "subnet-045be084c9881ad9b" -> (known after apply)
        tags                                 = {
            "Name" = "qa-ubuntu"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0cff31e54948e47be" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.server-mgmnt must be replaced
-/+ resource "aws_instance" "server-mgmnt" {
      ~ arn                                  = "arn:aws:ec2:eu-central-1:919293050237:instance/i-02b9daaca305a1fdd" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "eu-central-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      ~ id                                   = "i-02b9daaca305a1fdd" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0648170bacf73e497" -> (known after apply)
      ~ private_dns                          = "ip-172-31-36-73.eu-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.36.73" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "aws-mgmnt-sg20230419122042743000000001",
        ] -> (known after apply)
      ~ subnet_id                            = "subnet-045be084c9881ad9b" -> (known after apply)
        tags                                 = {
            "Name" = "server-mgmnt"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (8 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0f1b462a31cbaa01a" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.web-server-ubuntu must be replaced
-/+ resource "aws_instance" "web-server-ubuntu" {
      ~ arn                                  = "arn:aws:ec2:eu-central-1:919293050237:instance/i-04fc3fbccb836b4ff" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "eu-central-1b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-04fc3fbccb836b4ff" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "stopped" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-0be14a3a6ba439166" -> (known after apply)
      ~ private_dns                          = "ip-172-31-41-47.eu-central-1.compute.internal" -> (known after apply)
      ~ private_ip                           = "172.31.41.47" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [
          - "base-sg20230420110227302900000001",
        ] -> (known after apply)
      ~ subnet_id                            = "subnet-045be084c9881ad9b" -> (known after apply)
        tags                                 = {
            "Name" = "web-server-ubuntu"
        }
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
        # (7 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0bb2eb08c4eb5d506" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

Plan: 6 to add, 0 to change, 6 to destroy.

```

</details>

*Pushed by: @CrutoiAlexandru, Action: `pull_request`*